[
    {
      "title": "Emerald Pea Pasta",
      "ingredients": "1 c Frozen green peas, defrosted|2 tb Chopped fresh mint|1 1/2 c All purpose flour|1 pn Salt|1 pn Pepper",
      "servings": "2 Servings",
      "instructions": "Place peas & mint in a food processor & puree. Add remaining ingredients & pulse until a ball of dough forms. Turn out onto a floured surface & knead until smooth & pliable like a firm bread dough. Place dough in a bowl, cover with plastic wrap & let rest for at least 30 minutes. Shape & cook dough as desired."
    },
    {
      "title": "Emeril's Cream Sauce over Angel Hair Pasta",
      "ingredients": "1 tb Olive oil|1/2 c Small diced Tasso sausage|2 tb Minced shallots|1 lb Crawfish tails|1 tb Minced garlic|1/2 c Peeled; seeded, and chopped Italian Plum tomatoes|1/2 c Chopped green onions|1 1/2 c Heavy cream|2 tb Butter|1 lb Angel hair pasta; cooked al denta|1/2 c Parmesan Cheese|2 tb Chopped chives|Salt and pepper",
      "servings": "1 Servings",
      "instructions": "1. In a large saute pan, heat the olive oil. 2. When the oil is hot, render the Tasso for 2 minutes. 3. Add the shallots and crawfish and saute for 1 minute. 4. Stir in the garlic, tomatoes, and green onions, saute for 1 minute. 5. Season the mixture with salt and pepper. 6. Stir in the cream and bring up to a boil. 7. Reduce the heat to a simmer and cook for 4-6 minutes or until the sauce has reduced enough to coat the back of a spoon. 8. Season the sauce with salt and pepper. 9. Stir the butter into the sauce. 10. Add the pasta to the pan and gently toss the pasta into the sauce. 11. Garnish the pasta with the grated cheese and chives. Note: Yields: 4 appetizer servings."
    },
    {
      "title": "Fresh Homemade Pasta with Wild Mushrooms",
      "ingredients": "2 tb Extra virgin olive oil|2 tb Chopped shallots|1 tb Chopped garlic|1/4 ts Red pepper flakes|2 oz Dried porcini mushrooms, washed and rehydrated|1/2 lb Cremini mushrooms, cleaned and sliced|Salt and freshly ground pepper to taste|1/2 c Heavy cream|6 qt Water, (up to 8)|2 tb Salt|1 lb Pasta, such as fettucine|2 tb Shredded fresh basil leaves|3 tb Pine nuts, toasted|1/4 c Freshly grated Parmesan cheese",
      "servings": "4 Servings",
      "instructions": "In a saute pan, heat the olive oil over medium heat. Add the shallots, garlic, red pepper and quickly saute being careful to avoid browning or burning. Add the mushrooms, season with salt and pepper and saute together for 5 minutes. Add the cream, reduce the heat to prevent the cream from scorching and cook for several minutes while the pasta cooks. Bring the water to a rolling boil in a large pot and add the salt. Add the pasta to the boiling water. To the mushrooms, add the basil, pine nuts and Parmesan cheese. The pasta will cook in several minutes after returning to the boil. Add the cooked pasta to the sauce and serve."
    },
    {
      "title": "Fresh Pasta",
      "ingredients": "3 c Flour|3 Eggs|3 tb Vegetable oil|1 ts Salt|6 tb Water",
      "servings": "4 Servings",
      "instructions": "Put flour in food processor bowl and add eggs. Blend for a few seconds. Scrape sides of work bowl and blend a few more seconds. Add vegetable oil and salt. Blend into flour mixture. While processor is running, add water in a slow stream. When dough forms a ball, it is ready. If a ball does not form, add 1 Tablespoon of water at a time until it does form a ball. (Do not let the dough get too gummy. If this does happen, take the dough out of the processor and lnead in a little more flour.) When the dough forms a ball, take it out of the processor and knead a few minutes in flour, form into a ball, cover with a bowl and let rest at least 20 minutes. Cut small fistfulls of dough off, pound out with your fist, and run through the pasta machine. Yield: 4 to 6 servings. BECKY MC KINNEY (MRS. RICHARD H., JR.)"
    },
    {
      "title": "Fresh Pasta",
      "ingredients": "1 1/2 c All-purpose flour|2 Eggs",
      "servings": "6 Servings",
      "instructions": "Place flour in work bowl of food processor fitted with steel blade. Add eggs and process until dough comes together and forms ball that rides around on top of blade. If mixture is too dry and fails to form ball, slowly add just enough water to bring ball together, no more than 1 tablespoon. Dough ball should be slightly sticky. If too sticky and soft, add flour 1 teaspoon at time until texture is correct. Knead dough by running processor. Ball with ride around on top of blade, becoming more and more smooth. When smooht enough, remove from processor. Wrap in plastic wrap. Let stand at least 45 minutes. Roll dough out in pasta machine. Divide in quarters and work with 1 portion at time, keeping remainder wrapped in plastic wrap. Flatten dough, then run through machine on widest setting. Fold double and run through again, folded edge first. Repeat 2 or 3 times. Fold double again, and run through sideways. Repeat 2 or 3 more times. Dough will change from fairly sticky and possibly slightly dimpled on 1 side to satiny and smooth. Sheet should be as wide as baking dish (if not, layer dish with 2 sheets rather than 1). Change pasta machine to next-narrower setting. Run dough through machine once. Repeat until next-to-last setting. Before rolling out at next-to-last setting, cut pasta sheet in half. After rolling out at next-to-last setting, lay pasta sheet on lightly floured dish towel and cover with another dish towel. Repeat until all dough has been rolled out."
    },
    {
      "title": "Fresh Pasta Primavera",
      "ingredients": "1 lg Tomato|1 Cucumber|1 Green bell pepper|2 Carrots|2 Cloves garlic|1 pk Penne pasta",
      "servings": "4 Servings",
      "instructions": "Peel and finely dice vegetables. Cook pasta. Strain pasta and place in large bowl. Add fresh (uncooked) vegetables immediately and stir. Add salt, pepper, fresh basil, and serve. You can also add ff parmesan and any other fresh herbs that you like."
    },
    {
      "title": "Fresh Pesto Pasta",
      "ingredients": "3 Cloves garlic, sliced|2 tb Olive oil|2 c Fresh Basil leaves|1/4 c Water|1 ts Light-colored miso|1 tb Lemon juice|6 tb Toasted Pine nuts|9 oz Dry durum wheat pasta|1 Sweet red pepper, cut|Into slivers",
      "servings": "4 Servings",
      "instructions": "Saute garlic in olive oil. Place in blender or food processor container with basil, 1/4 cup water, miso, lemon juice and 3 Tblsp. pine nuts. Process until smooth, adding remaining 1/4 cup water if thinner consistency is desired. Cook pasta al dente according to package directions. Drain. Serve sauce over pasta, sprinkled with 3 Tblsp. pine nuts and garnished with red pepper slivers."
    },
    {
      "title": "Fresh Tomato Basil Sauce with Angel Hair Pasta",
      "ingredients": "1 lb (.5 kg). angel hair pasta|4 md Tomatoes (chopped)|1 md Onion (chopped)|1 1/2 tb (20 ml) garlic powder|1 1/2 tb (20 ml) basil|1 1/2 tb (20 ml) oregano|1 ts (5 ml). sugar|4 tb (60 ml) olive oil|Salt and pepper to taste",
      "servings": "4 Servings",
      "instructions": "Heat oil in saucepan on medium heat. Saute onion for 3 minutes. Add tomato and spices, and mix. Cook for 5 minutes more and reduce heat or remove from heat. Boil pasta al dente. Drain pasta, and add the sauce. Can be served with herbed grilled chicken."
    },
    {
      "title": "Fresh Tuna and Sun -Dried Tomatoes over Pasta",
      "ingredients": "1/2 c Olive oil|1 Onion, thinly sliced|4 Carrots, thinly sliced|1/2 c Oil packed sun-dried tomatoes, cut in thin strips|1 lb Elbow macaroni-penne or fusilli|12 oz Fresh tuna, cut in small cubes|2 tb Drained capers|1/4 c Pitted oil-cured olives, chopped|1 ts Dried red pepper flakes|1 c Fresh Italian parsley, chopped|Salt",
      "servings": "4 Servings",
      "instructions": "Bring a large pot of salted water to a boil. While this is coming to a boil, heat the olive oil in a large skillet. Add the onion and carrots and saute uncovered, until somewhat softened, about 5 minutes. Stir in the sun-dried tomatoes, lower the heat, cover and simmer until carrots and onions are completely tender, 10 minutes more. Add the pasta to the water and cook for about 10 minutes or until al dente. While pasta is cooking, add tuna, capers and olives to the skillet and saute for a couple of minutes or until tuna is just cooked through. Season to taste with red pepper and taste for salt. Drain pasta, and return it to the pot with parsley; toss until well blended. Spoon pasta into warm pasta bowls and top with tuna sauce. Serve immediately. Yield: 4 servings"
    },
    {
      "title": "Fried Egg, Red Pepper, Garlic, and Herb Topping for Pasta",
      "ingredients": "3 tb Extra-virgin olive oil|2 tb Unsalted butter|2 lg Garlic cloves; thinly sliced|4 lg Eggs; (preferably from free-range chicken)|Coarse salt to taste|Crushed hot red pepper flakes to taste|1/2 c Freshly grated Parmigiano-Reggiano plus additional as an accompaniment|1/4 c Minced fresh parsley|1 tb Minced fresh oregano or sage",
      "servings": "4 Servings",
      "instructions": "While the pasta for this dish is cooking, heat the olive oil and butter in a large skillet over moderate heat. Add the garlic and cook, stirring, for 2 minutes. Add the eggs and cook, sunny-side up, basting with a spoon, for 2 to 3 minutes without turning, or until the eggs are just done (the yolks must remain runny). Remove the pan from the heat and sprinkle eggs with coarse salt and hot red pepper flakes. You must time this dish so that the pasta is ready as soon as the eggs are done. Place the pasta on a serving platter and toss with the Parmigiano-Reggiano, additional red pepper flakes, and parsley. Pour the contents of the egg pan, including the oil, butter, and garlic, onto the pasta. Garnish pasta and eggs with oregano or sage and serve immediately. Pass the additional Parmigiano-Reggiano at the table."
    }
  ]